# Brewfile에서 사용하는 앱 설치 명령어
# brew : asdf, awscli, git, mas 등 개발 패키지
# cask : Docker, Chrome, VSCode 등 웹에서 다운받아 설치
# mas : 카카오톡, Todoist 등 앱스토어를 통해 설치

# 검색
# 웹에서 다운받아 설치하는 앱 검색 : brew search intellij
# 앱스토어에서 다운받아 설치하는 앱 검색 : mas search Xcode

# Brewfile 실행 명령어
# brew bundle

# tap "homebrew/bundle"

# brew ======================================================================================================================================================================================================

brew "python3"
brew "ruby"
brew "cocoapods"
brew "wget"
brew "git"
brew "mas"
brew "awscli"

# cask ======================================================================================================================================================================================================

tap "homebrew/cask"
cask "docker"
cask "google-chrome"
cask "android-studio"
cask "visual-studio-code"
cask "intellij-idea-ce"
cask "sourcetree"
cask "iterm2"
cask "postman"
cask "karabiner-elements"
cask "keka"
cask "rectangle"

# mas ======================================================================================================================================================================================================

mas "Xcode", id: 497799835


